handlers/multiple-account-api/test/fixtures/weekend-subscription.json

{
	"success": true,
	"id": "71a11cc8ded9d71b8b7d75c31295009a",
	"accountId": "8ad083f0961a05fc019620184f8722ec",
	"accountNumber": "A00991426",
	"accountName": "001UD00000GXdmDYAT",
	"invoiceOwnerAccountId": "8ad083f0961a05fc019620184f8722ec",
	"invoiceOwnerAccountNumber": "A00991426",
	"invoiceOwnerAccountName": "001UD00000GXdmDYAT",
	"subscriptionNumber": "A-S00974337",
	"version": 2,
	"revision": "2.0",
	"termType": "TERMED",
	"invoiceSeparately": false,
	"contractEffectiveDate": "2025-04-10",
	"serviceActivationDate": "2025-04-10",
	"customerAcceptanceDate": "2025-04-19",
	"subscriptionStartDate": "2025-04-10",
	"subscriptionEndDate": "2027-04-10",
	"lastBookingDate": "2026-04-10",
	"termStartDate": "2026-04-10",
	"termEndDate": "2027-04-10",
	"initialTerm": 12,
	"initialTermPeriodType": "Month",
	"currentTerm": 12,
	"currentTermPeriodType": "Month",
	"autoRenew": true,
	"renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
	"renewalTerm": 12,
	"renewalTermPeriodType": "Month",
	"currency": "GBP",
	"contractedMrr": 33.99,
	"totalContractedValue": 805.89,
	"notes": null,
	"status": "Active",
	"TrialPeriodPrice__c": null,
	"CanadaHandDelivery__c": null,
	"AcquisitionMetadata__c": null,
	"QuoteNumber__QT": null,
	"GifteeIdentityId__c": null,
	"OpportunityName__QT": null,
	"LastQSSPaymentDate__c": null,
	"GiftNotificationEmailDate__c": null,
	"Gift_Subscription__c": "No",
	"TrialPeriodDays__c": null,
	"CreatedRequestId__c": "7e9327eb-1b4a-4453-0000-000000000212",
	"ActivationDate3__c": null,
	"AcquisitionSource__c": null,
	"CreatedByCSR__c": null,
	"CASSubscriberID__c": null,
	"LastPriceChangeDate__c": null,
	"InitialPromotionCode__c": null,
	"Suspended__c": "false",
	"CpqBundleJsonId__QT": null,
	"RedemptionCode__c": null,
	"QuoteType__QT": null,
	"GiftRedemptionDate__c": null,
	"QuoteBusinessType__QT": null,
	"SupplierCode__c": null,
	"legacy_cat__c": null,
	"DeliveryAgent__c": null,
	"AcquisitionCase__c": null,
	"ReaderType__c": "Direct",
	"ActivationDate__c": null,
	"UserCancellationReason__c": null,
	"SuspensionStatus__c": "Active",
	"CardCountry__c": null,
	"OpportunityCloseDate__QT": null,
	"IPaddress__c": null,
	"IPCountry__c": null,
	"CancelledBy__c": null,
	"LastPlanAddedDate__c": null,
	"dummy__c": null,
	"PromotionCode__c": null,
	"OriginalSubscriptionStartDate__c": null,
	"LegacyContractStartDate__c": null,
	"CancellationReason__c": null,
	"billToContact": {
		"id": "8ad083f0961a05fc019620184fa222ff",
		"address1": "33 Weymouth Avenue",
		"address2": "",
		"city": "London",
		"country": "United Kingdom",
		"county": null,
		"fax": null,
		"state": null,
		"postalCode": "W5 4SB",
		"firstName": "Helene",
		"lastName": "Samson",
		"nickname": null,
		"workEmail": "helene.samson+am5a3omcv489bg6xtsa@guardian.co.uk",
		"personalEmail": null,
		"homePhone": null,
		"mobilePhone": null,
		"otherPhone": null,
		"otherPhoneType": null,
		"taxRegion": null,
		"workPhone": null,
		"contactDescription": null,
		"Company_Name__c": null,
		"SpecialDeliveryInstructions__c": null,
		"Title__c": null,
		"zipCode": "W5 4SB",
		"accountId": "8ad083f0961a05fc019620184f8722ec",
		"accountNumber": "A00991426",
		"isSpecifiedInSubscription": false
	},
	"paymentTerm": null,
	"invoiceTemplateId": null,
	"invoiceTemplateName": null,
	"sequenceSetId": null,
	"sequenceSetName": null,
	"soldToContact": {
		"id": "8ad083f0961a05fc019620184fb32301",
		"address1": "33 Weymouth Avenue",
		"address2": "",
		"city": "London",
		"country": "United Kingdom",
		"county": null,
		"fax": null,
		"state": null,
		"postalCode": "W5 4SB",
		"firstName": "Helene",
		"lastName": "Samson",
		"nickname": null,
		"workEmail": "helene.samson+am5a3omcv489bg6xtsa@guardian.co.uk",
		"personalEmail": null,
		"homePhone": null,
		"mobilePhone": null,
		"otherPhone": null,
		"otherPhoneType": null,
		"taxRegion": null,
		"workPhone": null,
		"contactDescription": null,
		"Company_Name__c": null,
		"SpecialDeliveryInstructions__c": null,
		"Title__c": null,
		"zipCode": "W5 4SB",
		"accountId": "8ad083f0961a05fc019620184f8722ec",
		"accountNumber": "A00991426",
		"isSpecifiedInSubscription": false
	},
	"isLatestVersion": true,
	"cancelReason": null,
	"ratePlans": [
		{
			"id": "71a11cc8ded9d71b8b7d75c3129b009c",
			"productId": "2c92c0f955c3cf0f0155c5d9ddc53bc3",
			"productName": "Newspaper Delivery",
			"productSku": "SKU-00000038",
			"productRatePlanId": "2c92c0f955c3cf0f0155c5d9df433bf7",
			"productRatePlanNumber": "PRP-00000097",
			"ratePlanName": "Weekend",
			"subscriptionProductFeatures": [],
			"externallyManagedPlanId": null,
			"subscriptionRatePlanNumber": "SRP-01663631",
			"isFromExternalCatalog": false,
			"originalRatePlanId": "71a1b9d74c3961a05de620185001a041",
			"ratePlanCharges": [
				{
					"id": "71a11cc8ded9d71b8b7d75c3129d00a0",
					"originalChargeId": "71a1b9d74c3961a05de620185025a048",
					"productRatePlanChargeId": "2c92c0f955c3cf0f0155c5d9df963c01",
					"number": "C-01700806",
					"name": "Sunday",
					"productRatePlanChargeNumber": "PRPC-00000144",
					"type": "Recurring",
					"model": "FlatFee",
					"originalListPrice": null,
					"uom": null,
					"version": 2,
					"subscriptionChargeDeliverySchedule": null,
					"numberOfDeliveries": null,
					"priceChangeOption": "NoChange",
					"priceIncreasePercentage": null,
					"currency": "GBP",
					"chargeModelConfiguration": null,
					"inputArgumentId": null,
					"includedUnits": null,
					"overagePrice": null,
					"applyDiscountTo": null,
					"discountLevel": null,
					"discountClass": null,
					"applyToBillingPeriodPartially": false,
					"billingDay": "ChargeTriggerDay",
					"listPriceBase": "Per_Billing_Period",
					"specificListPriceBase": null,
					"billingPeriod": "Month",
					"specificBillingPeriod": null,
					"billingTiming": "IN_ADVANCE",
					"ratingGroup": null,
					"billingPeriodAlignment": "AlignToCharge",
					"quantity": 1.0,
					"prorationOption": null,
					"isStackedDiscount": false,
					"reflectDiscountInNetAmount": false,
					"smoothingModel": null,
					"numberOfPeriods": null,
					"overageCalculationOption": null,
					"overageUnusedUnitsCreditOption": null,
					"unusedUnitsCreditRates": null,
					"usageRecordRatingOption": null,
					"segment": 1,
					"effectiveStartDate": "2025-04-19",
					"effectiveEndDate": "2027-04-10",
					"processedThroughDate": "2026-04-19",
					"chargedThroughDate": "2026-05-19",
					"done": false,
					"triggerDate": null,
					"triggerEvent": "CustomerAcceptance",
					"endDateCondition": "Subscription_End",
					"upToPeriodsType": null,
					"upToPeriods": null,
					"specificEndDate": null,
					"mrr": 16.99,
					"dmrc": 0.0,
					"tcv": 402.827419349,
					"dtcv": 203.88,
					"originalOrderDate": "2025-04-10",
					"amendedByOrderOn": "2026-04-10",
					"description": "",
					"HolidayStart__c": null,
					"HolidayEnd__c": null,
					"ForceSync__c": null,
					"salesPrice": 16.99,
					"taxable": null,
					"taxCode": null,
					"taxMode": null,
					"isLastSegment": true,
					"tiers": null,
					"discountApplyDetails": null,
					"pricingSummary": "GBP16.99",
					"price": 16.99,
					"discountAmount": null,
					"discountPercentage": null,
					"originalListDiscountAmount": null,
					"originalListDiscountPercentage": null
				},
				{
					"id": "71a11cc8ded9d71b8b7d75c3129d009e",
					"originalChargeId": "71a1b9d74c3961a05de62018501fa047",
					"productRatePlanChargeId": "2c92c0f955c3cf0f0155c5d9df5c3bf9",
					"number": "C-01700805",
					"name": "Saturday",
					"productRatePlanChargeNumber": "PRPC-00000147",
					"type": "Recurring",
					"model": "FlatFee",
					"originalListPrice": null,
					"uom": null,
					"version": 2,
					"subscriptionChargeDeliverySchedule": null,
					"numberOfDeliveries": null,
					"priceChangeOption": "NoChange",
					"priceIncreasePercentage": null,
					"currency": "GBP",
					"chargeModelConfiguration": null,
					"inputArgumentId": null,
					"includedUnits": null,
					"overagePrice": null,
					"applyDiscountTo": null,
					"discountLevel": null,
					"discountClass": null,
					"applyToBillingPeriodPartially": false,
					"billingDay": "ChargeTriggerDay",
					"listPriceBase": "Per_Billing_Period",
					"specificListPriceBase": null,
					"billingPeriod": "Month",
					"specificBillingPeriod": null,
					"billingTiming": "IN_ADVANCE",
					"ratingGroup": null,
					"billingPeriodAlignment": "AlignToCharge",
					"quantity": 1.0,
					"prorationOption": null,
					"isStackedDiscount": false,
					"reflectDiscountInNetAmount": false,
					"smoothingModel": null,
					"numberOfPeriods": null,
					"overageCalculationOption": null,
					"overageUnusedUnitsCreditOption": null,
					"unusedUnitsCreditRates": null,
					"usageRecordRatingOption": null,
					"segment": 1,
					"effectiveStartDate": "2025-04-19",
					"effectiveEndDate": "2027-04-10",
					"processedThroughDate": "2026-04-19",
					"chargedThroughDate": "2026-05-19",
					"done": false,
					"triggerDate": null,
					"triggerEvent": "CustomerAcceptance",
					"endDateCondition": "Subscription_End",
					"upToPeriodsType": null,
					"upToPeriods": null,
					"specificEndDate": null,
					"mrr": 17.0,
					"dmrc": 0.0,
					"tcv": 403.064516123,
					"dtcv": 204.0,
					"originalOrderDate": "2025-04-10",
					"amendedByOrderOn": "2026-04-10",
					"description": "",
					"HolidayStart__c": null,
					"HolidayEnd__c": null,
					"ForceSync__c": null,
					"salesPrice": 17.0,
					"taxable": null,
					"taxCode": null,
					"taxMode": null,
					"isLastSegment": true,
					"tiers": null,
					"discountApplyDetails": null,
					"pricingSummary": "GBP17",
					"price": 17.0,
					"discountAmount": null,
					"discountPercentage": null,
					"originalListDiscountAmount": null,
					"originalListDiscountPercentage": null
				}
			]
		}
	],
	"orderNumber": "O-01177630",
	"externallyManagedBy": null,
	"statusHistory": [
		{
			"startDate": "2025-04-10",
			"endDate": "2027-04-10",
			"status": "Active"
		},
		{
			"startDate": "2027-04-10",
			"endDate": null,
			"status": "OutOfTerm"
		}
	],
	"invoiceGroupNumber": null,
	"createTime": "2026-04-10 06:00:11",
	"updateTime": "2026-04-19 06:00:12",
	"scheduledCancelDate": null,
	"scheduledSuspendDate": null,
	"scheduledResumeDate": null,
	"communicationProfileId": null,
	"totalNumberOfChargeSegments": 2
}
